# pandas

To get started with pandas, you will need to get comfortable with its two workhorse data structures: Series and DataFrame. While they are not a universal solution for every problem, they provide a solid, easy-to-use basis for most applications.

In this notebook we will focus on:
1. Series
    * Defining series
    * Indexing and accesing elements
    * Operations
2. Dataframes
    * Creating dataframes
    * Indexing, selecting and filtering
    * Loading dataframes from external files
    * Functions
        * Delete Columns
        * Transpose
        * Group By
        * Apply
        * Merge
        * Join
        * Missing Data

In [1]:
from pandas import Series, DataFrame
import pandas as pd

<div class="alert alert-info">By agreement (Developer Community) `pd` is used as an alias for `pandas` library.</div>

## 1 · Series
A Series is a one-dimensional array-like object containing an array of data (of any NumPy data type) and an associated array of data labels, called its index.

    Serie format
    
    <index> <value>
    0       big
    1       data
    2       mola

In [2]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### Defining Series 
We can create a serie in two different ways:
* Setting the values and indices with **lists**.
* Converting a **dictionary** into a serie. Keys will be the indices.

In [6]:
# Setting the values and indices with lists
names = ['Navas', 'Carvajal', 'Pepe', 'Ramos', 'Varane', 'Nacho', 'Marcelo', 'Coentrao', 'Danilo', 'Kroos', 'James',
     'Casemiro','Kovacic', 'Modric', 'Asensio', 'Isco','Ronaldo', 'Benzema', 'Bale', 'Lucas Vazquez', 'Mariano', 'Morata']
dorsales = [1, 2, 3, 4, 5, 6, 12, 15, 23, 8, 10, 14, 16, 19, 20, 22, 7, 9, 11, 17, 18, 21]

realMadridPlayers = pd.Series(index = dorsales, data = names)

print("Plantilla del Real Madrid 2017: \n%s" %realMadridPlayers)

Plantilla del Real Madrid 2017:
1             Navas
2          Carvajal
3              Pepe
4             Ramos
5            Varane
6             Nacho
12          Marcelo
15         Coentrao
23           Danilo
8             Kroos
10            James
14         Casemiro
16          Kovacic
19           Modric
20          Asensio
22             Isco
7           Ronaldo
9           Benzema
11             Bale
17    Lucas Vazquez
18          Mariano
21           Morata
dtype: object

In [7]:
# Converting a dictionary into a serie. Keys will be the indices
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
Poblacion = Series(sdata)
Poblacion

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [8]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
PoblacionOeste = Series(sdata, index=states)
PoblacionOeste

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### Indexing and accesing elements

In [9]:
elBicho = realMadridPlayers[7]
PopOhio = PoblacionOeste['Ohio']

print("El Bicho se llama",elBicho)
print("Ohio tiene {} habitantes".format(int(PopOhio)))

El Bicho se llama Ronaldo
Ohio tiene 35000 habitantes

In [10]:
delanterosOrdenados = realMadridPlayers[[20,21,22]]
print(delanterosOrdenados)

20    Asensio
21     Morata
22       Isco
dtype: object

In [11]:
PoblacionOeste[PoblacionOeste > 40000]

Texas    71000.0
dtype: float64

In [12]:
import numpy as np
PoblacionSQRT = np.sqrt(Poblacion)
PoblacionSQRT

Ohio      187.082869
Oregon    126.491106
Texas     266.458252
Utah       70.710678
dtype: float64

In [13]:
7 in realMadridPlayers

True

### Operations

In [14]:
pd.isnull(PoblacionOeste)
PoblacionOeste.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [15]:
Poblacion + PoblacionOeste

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [16]:
PoblacionOeste.name = 'population'
PoblacionOeste.index.name = 'state'
PoblacionOeste

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

## 2 · DataFrame
A DataFrame represents a **tabular, spreadsheet-like data structure containing an ordered collection of columns**, each of which can be a different value type (numeric,string, boolean, etc.). 

The DataFrame has both a row and column index; it can be thought of as a dict of Series (one for all sharing the same index). 

    <index> <column0> <column2> ... <columnC>
          0    ...       ...           ...
          1    ...       ...           ...
          2    ...       ...           ...
          .    ...       ...           ...
          .    ...       ...           ...
          .    ...       ...           ...
          R    ...       ...           ...

Compared with other such DataFrame-like structures you may have used before (like R’s data.frame ), row-oriented and column-oriented operations in DataFrame are treated roughly symmetrically. Under the hood, the data is stored as one or more two-dimensional blocks rather than a list, dict, or some other collection of one-dimensional arrays.

### Creating Dataframes
There are numerous ways to construct a DataFrame, the most common ones,
* From a **dict of equal-length lists**
* **NumPy arrays**
* A **nested dict of dicts**

In [17]:
# From a dictionary
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [18]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [19]:
frame2 = DataFrame(data, 
                   columns=['year', 'state', 'pop', 'debt'], # We create an empty column
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [20]:
# From matrix and columns
columnsDF = ['cod_ofictrn','imp_trans','cod_user','cod_npuesto','cod_persona']
list_listas = [[1557,5000,'U044181','02',5133579],[2585,13000,'E018157','03',23783944],[2626,19000,'UA16687','01',12024444]]

DF_1 = pd.DataFrame(list_listas,
                    columns = columnsDF)
DF_1

   cod_ofictrn  imp_trans cod_user cod_npuesto  cod_persona
0         1557       5000  U044181          02      5133579
1         2585      13000  E018157          03     23783944
2         2626      19000  UA16687          01     12024444

In [21]:
# From matrix, columns and index:

indexDF = ['A','A','C']

DF_2 = pd.DataFrame(list_listas,
                    index = indexDF,
                    columns = columnsDF)
DF_2

   cod_ofictrn  imp_trans cod_user cod_npuesto  cod_persona
A         1557       5000  U044181          02      5133579
A         2585      13000  E018157          03     23783944
C         2626      19000  UA16687          01     12024444

In [22]:
# A nested dict of dicts
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
DataFrame(pop)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

### Indexing and filtering: select columns, rows and elements

In [23]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan]], dtype=object)

#### Select columns

In [24]:
frame.columns

Index(['pop', 'state', 'year'], dtype='object')

In [25]:
frame['state']
frame.state # This way can confuse with dataframe methods
# It returns a serie

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [26]:
# Selecting more than one column
frame[['state','pop']]

    state  pop
0    Ohio  1.5
1    Ohio  1.7
2    Ohio  3.6
3  Nevada  2.4
4  Nevada  2.9

#### Select by index

In [27]:
frame2.iloc[2]

frame2.loc['three']
# They return the row as a serie

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [28]:
# Selecting more than one row by index
frame2[1:3]
frame2.iloc[[1,2]]
frame2.iloc[:2]# When selecting with slices, no [] is needed

     year state  pop debt
one  2000  Ohio  1.5  NaN
two  2001  Ohio  1.7  NaN

In [29]:
frame2[:2]

     year state  pop debt
one  2000  Ohio  1.5  NaN
two  2001  Ohio  1.7  NaN

In [30]:
indices = ['three','one','four']
states = ['pop','year']

frame2.loc[indices,states]
frame2.iloc[[2,0,3],[2,0]]

       pop  year
three  3.6  2002
one    1.5  2000
four   2.4  2001

#### Change values

In [31]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [32]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [33]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [34]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

#### Filtering

In [43]:
data = DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [44]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [45]:
mask = data < 5
mask

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [46]:
data[mask] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [52]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

#### Reindexing
A critical method on pandas objects is reindex , which means to create a new object with the data conformed to a new index.

In [53]:
frame2.reindex(index=['three', 'one', 'seven', 'two'],fill_value = 0,columns=states)

       pop  year
three  3.6  2002
one    1.5  2000
seven  0.0     0
two    1.7  2001

### Loading dataframes from external files

Pandas supports these file formats to read dataframes.
* **Data files**: read_csv , read_table
* **Structured Data**: read_hdf , read_json
* **Excel**: read_excel

In [57]:
# Read csv file: Base_evolucion_fondos.csv located in data.

base_evolucion_path = "../data/Base_evolucion_fondos.csv"
df = pd.read_csv(base_evolucion_path, header= None) # Try with header = 0
df.head()

,COD_USUARIO,COD_SEGLOBAL,fondos_201507,fondos_201508,fondos_201509,fondos_201510,fondos_201511,fondos_201512
0,E000170,NaN,0.00,0.00,0.00,0.00,0.00,0.00
1,E000170,34.0,0.00,0.00,0.00,0.00,0.00,0.00
2,E000170,35.0,0.00,0.00,0.00,0.00,0.00,0.00
3,E000170,36.0,0.00,0.00,0.00,0.00,0.00,0.00
4,E000170,37.0,11684.42,11673.35,11675.79,11687.85,11696.99,11687.41

In [59]:
# Read excel file: tablas_sinfo.xlsx located in data.

pd.read_excel('../data/tablas_sinfo.xlsx', sheet_name='SINFO').head()

  PETICIONARIO     VISTA                    DESCRIPCIÓN ÁMBITO
0        SINFO  VSFMABJC     PLASTICO TARJETA CREDITO_M  SINFO
1        SINFO  VSFMABJD      PLASTICO TARJETA DEBITO_M  SINFO
2        SINFO  VSFMAHAR  CONT DE MVTOS CUENTAS PERSO_M  SINFO
3        SINFO  VSFMAHOM     FACTURACION EN COMERCIOS_M  SINFO
4        SINFO  VSFMAHSS  CONTRATO DE SEGUROS SOCIALE_M  SINFO

### Functions

#### Delete columns

In [60]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

#### Transpose

In [61]:
frame2.T

        one   two three    four    five
year   2000  2001  2002    2001    2002
state  Ohio  Ohio  Ohio  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9
debt    NaN  -1.2   NaN    -1.5    -1.7

#### Apply

In [62]:
# Split delimited values in a DataFrame column into two new columns. Split column concatenated with delimeted : and get first item.

df['a'] = df['fondos_201507'].apply(lambda x:x)
df.head()

,COD_USUARIO,COD_SEGLOBAL,fondos_201507,fondos_201508,fondos_201509,fondos_201510,fondos_201511,fondos_201512,a
0,E000170,NaN,0.00,0.00,0.00,0.00,0.00,0.00,0.00
1,E000170,34.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00
2,E000170,35.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00
3,E000170,36.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00
4,E000170,37.0,11684.42,11673.35,11675.79,11687.85,11696.99,11687.41,11684.42

#### Group By

In [63]:
# Group by and aggregation function over all columns it is possible

df.groupby("COD_USUARIO").mean().head()

,COD_SEGLOBAL,fondos_201507,fondos_201508,fondos_201509,fondos_201510,fondos_201511,fondos_201512,a
COD_USUARIO,,,,,,,,
E000170,46.846154,1.706856e+04,1.649755e+04,1.622124e+04,1.681276e+04,1.536090e+04,1.361223e+04,1.706856e+04
E000501,51.428571,9.130090e+05,9.075834e+05,8.745818e+05,9.084203e+05,9.115475e+05,9.000623e+05,9.130090e+05
E000531,51.571429,1.115276e+06,1.107899e+06,1.094539e+06,1.132965e+06,1.134202e+06,1.129280e+06,1.115276e+06
E000545,50.300000,3.918370e+05,3.767131e+05,3.663443e+05,3.796563e+05,3.812436e+05,3.790332e+05,3.918370e+05
E000558,51.428571,2.829866e+05,2.734438e+05,2.723402e+05,2.787285e+05,2.728685e+05,2.749118e+05,2.829866e+05

In [64]:
# Maximum fondos_201507 by COD_USUARIO

df.groupby("COD_USUARIO").agg({"fondos_201507":"max"}).reset_index().head()

    #or
    
df.groupby("COD_USUARIO")["fondos_201507"].max().reset_index().head()

  COD_USUARIO  fondos_201507
0     E000170      160260.96
1     E000501     5903439.20
2     E000531     6401503.37
3     E000545     3255015.86
4     E000558     1908020.96

In [65]:
# Mean fondos_201507 by COD_USUARIO, and rename column result to : Mean_fondos_201507

df.groupby(["COD_USUARIO","COD_SEGLOBAL"]).agg({"fondos_201507":"mean"}).rename(columns={"fondos_201507":"Mean_fondos_201507"}).head()

                          Mean_fondos_201507
COD_USUARIO COD_SEGLOBAL
E000170     34.0                        0.00
            35.0                        0.00
            36.0                        0.00
            37.0                    11684.42
            42.0                    67014.43

In [66]:
# Describe information about group dataframe

df.groupby(["COD_SEGLOBAL"]).describe().head()

                   a                                                        \
               count           mean           std  min  25%  50%       75%
COD_SEGLOBAL
31.0            35.0  553793.630286  2.657048e+06  0.0  0.0  0.0      0.00
32.0            99.0   86848.373737  4.492450e+05  0.0  0.0  0.0      0.00
33.0           240.0  122786.988833  6.419598e+05  0.0  0.0  0.0      0.00
34.0          1296.0  135300.574352  5.625421e+05  0.0  0.0  0.0      0.00
35.0          2561.0   96553.894662  2.530247e+05  0.0  0.0  0.0  67443.31

                          fondos_201507                    ...       \
                      max         count           mean     ...
COD_SEGLOBAL                                               ...
31.0          15726785.56          35.0  553793.630286     ...
32.0           3926567.00          99.0   86848.373737     ...
33.0           6090048.55         240.0  122786.988833     ...
34.0          11700082.83        1296.0  135300.574352     ...
35.0           3076807.95        2561.0   96553.894662     ...

             fondos_201511              fondos_201512                 \
                       75%          max         count           mean
COD_SEGLOBAL
31.0                  0.00  15052327.13          35.0  584604.212000
32.0                  0.00   3967544.88          99.0   86307.409192
33.0                  0.00   6092094.78         240.0  103893.654333
34.0                  0.00  11710008.20        1296.0  129874.926420
35.0              63995.66   2901359.66        2561.0   92002.312210


                       std  min  25%  50%       75%          max
COD_SEGLOBAL
31.0          2.381022e+06  0.0  0.0  0.0      0.00  13800771.06
32.0          4.456514e+05  0.0  0.0  0.0      0.00   3896948.66
33.0          5.720024e+05  0.0  0.0  0.0      0.00   5990942.92
34.0          5.505394e+05  0.0  0.0  0.0      0.00  11573091.49
35.0          2.443433e+05  0.0  0.0  0.0  62428.56   2872556.91

[5 rows x 56 columns]

#### Merge

In [67]:
data1 = {'Ciudad':['Trujillo', 'Las Pedroñeras', 'Navaluenga'], 'Provincia':['Caceres', 'Cuenca', 'Avila'], 'Poblacion':[10000, 2000, 400]}
data2 = {'Ciudad':['Trujillo', 'Las Pedroñeras', 'Navaluenga', 'Daimiel'], 'Poblacion':[12000, 1800, 380, 18000]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [68]:
df1

           Ciudad  Poblacion Provincia
0        Trujillo      10000   Caceres
1  Las Pedroñeras       2000    Cuenca
2      Navaluenga        400     Avila

In [69]:
df2

           Ciudad  Poblacion
0        Trujillo      12000
1  Las Pedroñeras       1800
2      Navaluenga        380
3         Daimiel      18000

In [70]:
# Merge two dataframes. Merge df1 and df2 (outer join) on Ciudad

diff = df1.merge(df2, how='outer', on='Ciudad', suffixes=['_2000', '_1970'])
diff

           Ciudad  Poblacion_2000 Provincia  Poblacion_1970
0        Trujillo         10000.0   Caceres           12000
1  Las Pedroñeras          2000.0    Cuenca            1800
2      Navaluenga           400.0     Avila             380
3         Daimiel             NaN       NaN           18000

In [71]:
pd.merge(df1,df2,how='inner',on='Ciudad', suffixes=['_2000', '_1970'])

           Ciudad  Poblacion_2000 Provincia  Poblacion_1970
0        Trujillo           10000   Caceres           12000
1  Las Pedroñeras            2000    Cuenca            1800
2      Navaluenga             400     Avila             380

#### Join

In [72]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [73]:
left.join(right, how = 'right')# By default, how is set to 'left'

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [74]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [75]:
# Order in ascending order by fondos_201507 show top 6

df.sort_values(by='fondos_201507', ascending = True).head(6)

,COD_USUARIO,COD_SEGLOBAL,fondos_201507,fondos_201508,fondos_201509,fondos_201510,fondos_201511,fondos_201512,a
0,E000170,NaN,0.0,0.0,0.0,0.0,0.0,0.0,0.0
16417,U091554,51.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
30026,U232050,51.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
16415,U091554,42.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
16414,U091554,36.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
16413,U091554,NaN,0.0,0.0,0.0,0.0,0.0,24606.9,0.0

#### Missing Data

In [76]:
import numpy

In [77]:
dic = {"A": [1,2,np.nan],"B": [3, np.nan, np.nan],"C": [1,2,3]}
d = pd.DataFrame(dic)
d

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [78]:
# Get the boolean mask where values an nan
pd.isnull(d).head()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [79]:
# Count number on missing values
d.isnull().sum().sum()

3

In [80]:
# Check if there is any null
d.isnull().values.any()

True

In [81]:
# Drop any rows that have missing data
d.dropna()

     A    B  C
0  1.0  3.0  1

In [82]:
# Filling missing data
d.fillna(value = "missing")

         A        B  C
0        1        3  1
1        2  missing  2
2  missing  missing  3

In [83]:
# Filling missing data with the mean of each column
d.fillna(value = d.mean())

     A    B  C
0  1.0  3.0  1
1  2.0  3.0  2
2  1.5  3.0  3